<!DOCTYPE html>
<html lang="it">
<head>
  <title>Sistema di gioco</title>
  <meta charset="utf-8" />
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="stylesheet" href="index.css" />
</head>

<body>
<header>
    <img id="testa" src="immagini/testa.jpg" alt="testa" />
<nav>
  <ul>
    <li><a href="index.html">Home</a></li>
    <li><a href="trama.html#centrale">Trama</a></li>
    <li><a href="sistemadigioco.html#centrale">Sistema di gioco</a></li>
    <li><a href="personaggi.html#centrale">Personaggi</a></li>
	<li><a href="gioco.html#centrale">Gioco</a></li>
	<li><a href="about.html#centrale">About</a></li>
  </ul>
</nav>
  </header>
  <div class="centrale" id="centrale">
 <div id="start">
 Il gioco ha come obiettivo generale quello di sbloccare i finali presenti nelle storie dei vari personaggi.
 La scelta della &quot;route&quot; (storia) dipende da due fattori:
 <br>
 1) La scelta della modalit&agrave; divisa tra: <a href="trama.html#descrizione1">Casual</a>, <a href="trama.html#descrizione2">Deep</a>,  <a href="trama.html#descrizione3">Another</a>
 <br>
 2) Le risposte date all'interno delle chat nei primi quattro giorni
  </div>
  
  <div id="messenger">
   <img id="prima" src="immagini/giorni.jpg" alt="schermata chat" />
   <div id="principale" >
  <h2> Messenger e Game Branch</h2>
  Ogni modalit&agrave; di gioco si articola in pi&ugrave; di 10 chatroom, ogni 1&ndash;2 ore, per undici giorni,
  alternate a visual novel. Gli orari sono pre&ndash;impostati e le chat sono attive finché non &egrave; disponibile la successiva.
  Le chat vanno avanti anche se non vi si partecipa ed é possibile recuperarle spendendo clessidre.
  <p>
  Durante le chat il giocatore dovr&agrave; dare delle risposte a scelta multipla per aumentare o diminuire l'affinit&agrave; con un personaggio.
  In base all'affinit&agrave; al termine del quarto giorno il giocatore affronter&agrave; la prima Game Branch
  ovvero potr&agrave; finire in una route o in un bad ending.
  Vi sono altre 3 Game Branch in ogni route, se non si superano si finisce in un Bad Ending ( Bad Story o Bad Relationship Ending).
 All'undicesimo giorno si pu&ograve; ottenere o il Good Ending o il Normal Ending in base al numero di invitati.
  </p>
  </div>
  
  </div>
  
  <div class="inciso1">
  <div id="telefonate" class="others">
  <img id="seconda" src="immagini/chiamate.jpg" alt="schermata telefonate" />
  <div class="testo">
  <h2>Chiamate</h2>
 Nel gioco &egrave; possibile ricevere chiamate dai personaggi. Sono ad orari preimpostati e NON influiscono sull'affinit&agrave;.
 Le chiamate possono essere riascoltate senza spendere clessidre. 
 <p>
 Il giocatore pu&ograve; a sua volta chiamare tramite i numeri preimpostati in &quot;Contacts&quot;
 al costo di 5 clessidre, 10 nella modalit&agrave;  <a href="trama.html#descrizione3">Another Story</a>.
 Inoltre i personaggi risponderanno soltanto in alcuni momenti, la chiamat pu&ograve; quindi andare a vuoto.
 &Egrave;. Con le condizioni sopracitate, si può richiamare in caso si sia persa una chiamata.
 </p>
 Le chiamate in entrata =  freccia verde ricolta all'interno.
 <br />
 Le chiamate in uscita andate a buon fine = freccia verde rivolta all'esterno.
 <br />
 Le chiamate perse = con una freccia rossa.
  </div>
  </div>
  
  <div id="messaggi" class="others">
 <img id="terza" src="immagini/messaggi.jpg" alt="schermata messaggi" />
 <div class ="testo">
  <h2>Messaggi</h2>
  Solitamente dopo una chat il giocatore riceve dei &quot;messaggi privati&quot; a cui si pu&ograve; rispodere con la
  scelta multipla. Vi &egrave; un tempo massimo per rispondere ai messaggi (solitamente fino all'apertura della
  nuova chat), nel caso non si risponda in tempo non sar&agrave; pi&ugrave; possibile rispondere fino al prossimo.
  <p>
  Con i messaggi &egrave; possibile ottenere o rompere i cuori.
  Dato, per&ograve;, che sono pochi i cuori non influisconno davvero sul finale.
  Da notare che il contenuto della risposta varia totalmente rispetto alla scelta che si &egrave; fatta.
  </p>
  </div>
  </div>
  </div>
  
  <div id="hearts">
  <img id="cuori" src="immagini/cuori.png" alt="cuori" />
  <div id="compensare">
  <div class ="testo" id="desccuori">
  <h2>Cuori</h2>
  I cuori possono essere considerati una seconda moneta all'interno del gioco assieme alle clessidre (100 cuori  =  1 clessidra)
  Cosa pi&ugrave; importante segnano un +1 punto a favore di un determinato personaggio in caso dirisposta "corretta".
  <p>
  Tuttavia dal 5 giorno, dopo la prima Game Branch, un cuore non porta automaticamente ad 
  un punto a favore della &quot;Good Ending&quot;. Alcuni opzioni infatti danno un cuore ma esso porta &egrave; un +1 per 
  la Bad Ending.
  </p>
  Alcune risposte vanno a togliere punti, queste vengono segnalate dall'animazione di un cuore che si rompe.
  <p></p>
  Esistono 8 cuori tutti di colori diversi e corrispondenti ad un personaggi:
  <p> <a href="zenscheda.html#centrale">Zen</a> = Cuore Grigio</p>
  <p> <a href="jeaheescheda.html#centrale">Jeahee</a> = Cuore Giallo/Marrone</p>
  <p> <a href="yoosungscheda.html#centrale">Yoosung</a> = Cuore Verde </p>
  <p> <a href="juminscheda.html#centrale">Jumin</a>  = Cuore Lavanda</p>
  <p> <a href="sevenscheda.html#centrale">Seven</a> = Cuore Rosso </p>
  <p> <a href="vscheda.html#centrale">V</a> = Cuore Blu Ceruleo </p>
  <p> Ray = Cuore Magenta</p>
  <p> Glitch = Cuore Bianco</p>
  I cuori possono essere ottenuti: nelle chat, nei messaggi, comprandoli o tramite il bonus &quot;spaceship&quot;.
  </div>
  </div>
  </div>
  
  
  <div class="inciso2">
  <div id="email" class="others">
  <img id="quarta" src="immagini/email.jpg" alt="schermata email" />
  <div class="testo">
  <h2>Email</h2>
  Le email sono una parte importante del gioco infatti &egrave; necessario portare un buon numero di invitati(10 o pi&ugrave; per Causal e Deep story
  e 17 o pi&ugrave; per Another Story) per ottenere il miglior finale possibile, altrimenti si incappa nel &quot;Normal Ending&quot;.
  <p> Le risposte sono a scelta multipla. Con una freccia verde verrano
  segnte le risposte corrette con una arancione quelle sbagliate. Vi &egrave; un tempo limite entro cui rispondere.
  </p>
  Se un invitato &egrave; venuto al party con successo l' 11 giorno (quindi con tutte le risposte corrette)
  quando il giocatore visita il suo profilo e clicka su &quot;story&quot; ricever&agrave; 1 clessidra.
  </div>
  </div>
  <div id="hourglass" class="others">
 <img id="quinta" src="immagini/Hourglass.png" alt="schermata hourglass" />
 <div class ="testo">
  <h2>Clessidre</h2>
  Sono la moneta del gioco, &egrave; possibile acquistarle con soldi veri oppure scambiare 100 cuori = 1 clessidra. Possono
  essere ottenute anche random all'interno delle chat o tramite il bonus giornaliero &quot;spaceship&quot;.
  Non sono strettamente necessarie per proseguire nel gioco, tuttavia sono necessarie per sbloccare:
  <p>&ndash; Le modalit&agrave; di gioco <a href="trama.html#descrizione2">Deep Story</a> e <a href="trama.html#descrizione3">Another Story</a></p>
  <p>&ndash;Comprare i contenuti scaricabili speciali (i DLC)</p>
  <p>&ndash; Caricare un salvataggio</p>
  <p>&ndash; Per saltare i primi 4 giorni e scegliere direttamente una route</p>
  <p>&ndash; Sbloccare chat perse</p>
  <p>&ndash; Aprire tutte le chat di un giorno per 24 ore cosi da non perderne nessuna</p>
  <p>&ndash; Chiamare i personaggi</p>
  <p>&ndash; Comprare un Save sloth in pi&ugrave;</p>
  </div>
  </div>
  
  
  </div>
  </div>
</body>
</html>
